---
kind: method
id: M:Autodesk.Revit.DB.Electrical.WireSizeSet.#ctor
source: html/14204ff7-f5b5-22bf-f8f7-95c0426cfc0f.htm
---
# Autodesk.Revit.DB.Electrical.WireSizeSet.#ctor Method

Initializes a new instance of the WireSizeSet class

## Syntax (C#)
```csharp
public WireSizeSet()
```